nodejs/payment/stripe/tests/customer.subscription.deleted.json

{
    "application": null,
    "application_fee_percent": null,
    "automatic_tax": {
        "enabled": false,
        "liability": null
    },
    "billing_cycle_anchor": 1707751320,
    "billing_cycle_anchor_config": null,
    "billing_thresholds": null,
    "cancel_at": null,
    "cancel_at_period_end": false,
    "canceled_at": 1707751323,
    "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": "cancellation_requested"
    },
    "collection_method": "charge_automatically",
    "created": 1707751320,
    "currency": "usd",
    "current_period_end": 1710256920,
    "current_period_start": 1707751320,
    "customer": "cus_PY7ZxKt5nLDwU2",
    "days_until_due": null,
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "ended_at": 1707751323,
    "id": "sub_1Oj1KWFcRmSNTPwAe4FbkOMn",
    "invoice_settings": {
        "account_tax_ids": null,
        "issuer": {
            "type": "self"
        }
    },
    "items": {
        "data": [
            {
                "billing_thresholds": null,
                "created": 1707751320,
                "id": "si_PY7ZKIay3vEni5",
                "metadata": {},
                "object": "subscription_item",
                "plan": {
                    "active": true,
                    "aggregate_usage": null,
                    "amount": 1500,
                    "amount_decimal": "1500",
                    "billing_scheme": "per_unit",
                    "created": 1707751319,
                    "currency": "usd",
                    "id": "price_1Oj1KVFcRmSNTPwACfMqKFXa",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {},
                    "nickname": null,
                    "object": "plan",
                    "product": "prod_PY7ZNbMvnf64Fu",
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "price": {
                    "active": true,
                    "billing_scheme": "per_unit",
                    "created": 1707751319,
                    "currency": "usd",
                    "custom_unit_amount": null,
                    "id": "price_1Oj1KVFcRmSNTPwACfMqKFXa",
                    "livemode": false,
                    "lookup_key": null,
                    "metadata": {},
                    "nickname": null,
                    "object": "price",
                    "product": "prod_PY7ZNbMvnf64Fu",
                    "recurring": {
                        "aggregate_usage": null,
                        "interval": "month",
                        "interval_count": 1,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "tax_behavior": "unspecified",
                    "tiers_mode": null,
                    "transform_quantity": null,
                    "type": "recurring",
                    "unit_amount": 1500,
                    "unit_amount_decimal": "1500"
                },
                "quantity": 1,
                "subscription": "sub_1Oj1KWFcRmSNTPwAe4FbkOMn",
                "tax_rates": []
            }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1Oj1KWFcRmSNTPwAe4FbkOMn"
    },
    "latest_invoice": "in_1Oj1KWFcRmSNTPwAkxssBhxi",
    "livemode": false,
    "metadata": {},
    "next_pending_invoice_item_invoice": null,
    "object": "subscription",
    "on_behalf_of": null,
    "pause_collection": null,
    "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
    },
    "pending_invoice_item_interval": null,
    "pending_setup_intent": null,
    "pending_update": null,
    "plan": {
        "active": true,
        "aggregate_usage": null,
        "amount": 1500,
        "amount_decimal": "1500",
        "billing_scheme": "per_unit",
        "created": 1707751319,
        "currency": "usd",
        "id": "price_1Oj1KVFcRmSNTPwACfMqKFXa",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": null,
        "object": "plan",
        "product": "prod_PY7ZNbMvnf64Fu",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
    },
    "quantity": 1,
    "schedule": null,
    "start_date": 1707751320,
    "status": "canceled",
    "test_clock": null,
    "transfer_data": null,
    "trial_end": null,
    "trial_settings": {
        "end_behavior": {
            "missing_payment_method": "create_invoice"
        }
    },
    "trial_start": null
}